// Task-2-2-ru.cpp : Этот файл содержит функцию 'main'. 
// Выполнение программы начинается и заканчивается здесь.

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include <stdbool.h>

int main(int argc, char* args[])
{
    unsigned int prev; // первая высота
    unsigned int curr; // вторая высота
    unsigned int next_val; // третья высота
    unsigned int peaks_count = 0;  // счётчик пиков
    bool b_done = false;  // флаг окончания цикла
    // Установка русской локали для терминала Windows 11
    system("chcp 65001 >nul");// 1-й способ. Выплнить внешнюю команду.
    setlocale(LC_ALL, "russian.65001"); // 2 - й способ. Вызов библиотечной функции.
    // Ввод данных
    // Вывод подсказки на экран
    printf("Введите данные радарной станции (0 - конец ввода).\r\n");
    // Считываем первые два элемента
    scanf("%u", &prev);  // ввод первой высоты
    scanf("%u", &curr);  // ввод второй высоты
    while (!b_done)
    {
        scanf("%d", &next_val);  // ввод третьей высоты
        // Если встретили 0, ввод окончен
        b_done = (next_val == 0);  // условие окончания цикла
        // Проверяем условие пика для текущего элемента
        if (!b_done && (curr > prev) && (curr > next_val))
        {
            peaks_count += 1;  // счётчик пиков увеличили на 1
        }
        // Сдвигаем «окно» из трёх элементов вперед
        prev = curr;
        curr = next_val;
    }
    printf("Количество пиков: %u\r\n", peaks_count);  // вывод на экран
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getchar();
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», 
//    чтобы добавить существующие файлы кода в проект